app/Http/Controllers/Dashboard/Orders/OrderController.php

    public function index(Request $request)
    {
        // Get pagination data sent by DataTables
        $start = $request->input('start', 0); // Start index
        $length = $request->input('length', 10); // Page size

        $regionIds = Auth()->user()->regions->pluck('region_id')->toArray();

        // Start building the query
        $ordersQuery = Order::query()
            ->whereHas('userAddress', function ($query) use ($regionIds) {
                $query->whereIn('region_id', $regionIds);
            })
            ->with(['user', 'bookings', 'transaction', 'status', 'bookings.visit.status', 'services.category']);

        if ($request->has('search_value') && $request->search_value != '') {
            $searchTerm = $request->search_value;

            $ordersQuery->where(function ($query) use ($searchTerm) {
                $query->where('id', 'like', "%{$searchTerm}%")
                    ->orWhere('total', 'like', "%{$searchTerm}%")
                    ->orWhere('created_at', 'like', "%{$searchTerm}%")
                    ->orWhere('user_id', 'like', "%{$searchTerm}%")
                    ->orWhereHas('user', function ($query) use ($searchTerm) {
                        $query->where('first_name', 'like', "%{$searchTerm}%");
                    });
            });

        }
        $orders = $ordersQuery->get();
---
SELECT * FROM `categories` WHERE `categories`.`id` in (7)
SELECT * FROM `orders` WHERE exists (SELECT * FROM `user_addresses` WHERE `orders`.`user_address_id` = `user_addresses`.`id` and `region_id` in (2, 3, 4) and `user_addresses`.`deleted_at` IS NULL)