app/Http/Controllers/Dashboard/Orders/OrderController.php

SELECT * FROM `bookings` WHERE `bookings`.`order_id` in (432, 500, 567, 607, 635, 665, 667, 668, 669, 670)
SELECT * FROM `orders` WHERE exists (SELECT * FROM `user_addresses` WHERE `orders`.`user_address_id` = `user_addresses`.`id` and `region_id` in (2, 3, 4) and `user_addresses`.`deleted_at` IS NULL) and `status_id` != 5 and date(`created_at`) = '2024-12-03' and `is_active` = 1 LIMIT 10 offset 0
SELECT * FROM `users` WHERE `users`.`id` in (76, 149, 424, 573, 663, 1279)
SELECT `services`.*, `order_services`.`order_id` as `pivot_order_id`, `order_services`.`service_id` as `pivot_service_id`, `order_services`.`price` as `pivot_price`, `order_services`.`quantity` as `pivot_quantity` FROM `services` inner join `order_services` on `services`.`id` = `order_services`.`service_id` WHERE `order_services`.`order_id` in (432, 500, 567, 607, 635, 665, 667, 668, 669, 670)
---
    public function ordersToday()
    {
        $regionIds = Auth()->user()->regions->pluck('region_id')->toArray();

        if (request()->ajax()) {
            $orders = Order::query()->whereHas('userAddress', function ($query) use ($regionIds) {
                $query->whereIn('region_id', $regionIds);
            })->with(['user', 'transaction', 'status', 'bookings.visit.status', 'services.category']);

            $now = Carbon::now('Asia/Riyadh')->toDateString();
            $orders->whereDate('created_at', '=', $now);

            if (request()->status) {

                $orders->where('status_id', request()->status);
            }

            $orders->where('is_active', 1)->get();

            return DataTables::of($orders)
                ->addColumn('booking_id', function ($row) {
                    $booking = $row->bookings->first();
                    return $booking ? $booking->id : '';
                })
                ->addColumn('user', function ($row) {
                    return $row->user?->first_name . ' ' . $row->user?->last_name;
                })
                ->addColumn('phone', function ($row) {
                    return $row->user?->phone
                    ? '<a href="https://api.whatsapp.com/send?phone=' . $row->user->phone . '" target="_blank" class="whatsapp-link" title="فتح في الواتساب">' . $row->user->phone . '</a>'
                    : 'N/A';
                })
                ->addColumn('service', function ($row) {
                    $services = $row->services->unique();
                    $html = '';
                    foreach ($services as $service) {
                        $html .= '<button class="btn-sm btn-primary">' . $service->title . '</button>';
                    }

                    return $html;
                })