app/Http/Controllers/Dashboard/Bookings/BookingController.php

                });
            }

            $visits = Visit::query()->pluck('booking_id')->toArray();
---
SELECT `booking_id` FROM `visits`