app/Http/Controllers/Api/Checkout/v2/PaymentController.php

INSERT INTO `payments` (`user_id`, `transaction_id`, `amount`, `status`, `payment_method`, `phone`, `gateway_response`, `payment_date`, `description`, `updated_at`, `created_at`) VALUES (35, , , 'pending', , , '\"\\\"dfgfdgdfgf\\\"\"', , , '2024-12-03 12:45:57', '2024-12-03 12:45:57')
---
    private function storePaymentData(Request $request)
    {
        $payment = new Payment();
        $payment->user_id = auth()->user()->id;
        $payment->transaction_id = $request->input('transaction_id');
        $payment->amount = $request->input('amount');
        $payment->status = $request->input('status', 'pending');
        $payment->payment_method = $request->input('payment_method', null);
        $payment->phone = $request->input('phone', null);
        $payment->gateway_response = json_encode($request->input('gateway_response'));
        $payment->payment_date = $request->input('payment_date', now());
        $payment->description = $request->input('description', null);
        $payment->save();