app/Http/Controllers/Dashboard/IndexController.php

SELECT count(*) as aggregate FROM `users`
SELECT count(*) as aggregate FROM `orders` WHERE `is_active` = 1 and exists (SELECT * FROM `user_addresses` WHERE `orders`.`user_address_id` = `user_addresses`.`id` and `region_id` in (2, 3, 4) and `user_addresses`.`deleted_at` IS NULL)
---
    protected function index()
    {

        $regionIds = Auth()->user()->regions->pluck('region_id')->toArray();
        $customers = User::count();

        $customersHaveOrders = User::has('orders')->count();

        $customer_complaints = CustomerComplaint::count();

        $complaints_unresolved = CustomerComplaint::where('customer_complaints_status_id', 1)->count();

        $complaints_resolved = CustomerComplaint::where('customer_complaints_status_id', 3)->count();

        $startOfToday = now()->timezone('Asia/Riyadh')->startOfDay();

        $endOfTodayPlus3Hours = now()->timezone('Asia/Riyadh')->endOfDay()->addHours(3);

        $todayCustomerComplaints = CustomerComplaint::whereBetween('created_at', [$startOfToday, $endOfTodayPlus3Hours])->count();

        // dd($todayCustomerComplaints);

        $client_orders = Order::where('is_active', 1)->whereHas('userAddress', function ($query) use ($regionIds) {
            $query->whereIn('region_id', $regionIds);
        })
            ->count();