app/Http/Controllers/Dashboard/IndexController.php

SELECT count(*) as aggregate FROM `orders` WHERE exists (SELECT * FROM `user_addresses` WHERE `orders`.`user_address_id` = `user_addresses`.`id` and `region_id` in (2, 3, 4) and `user_addresses`.`deleted_at` IS NULL) and `status_id` = 5 and `is_active` = 1
---
        $tech_visits    = Visit::where('is_active', 1)->count();

        // Get client orders for today and tomorrow's 3-hour window
        $client_orders_today = Order::where(function ($query) use ($now, $tomorrow, $startTime, $endTime, $regionIds) {
            $query->whereDate('created_at', $now)
                ->orWhere(function ($subQuery) use ($tomorrow, $startTime, $endTime) {
                    $subQuery->whereDate('created_at', $tomorrow)
                        ->whereBetween('created_at', [$startTime, $endTime]);
                });
        })
            ->where('status_id', '!=', 5) // Exclude canceled orders
            ->where('is_active', 1)       // Only active orders
            ->whereHas('userAddress', function ($query) use ($regionIds) {
                $query->whereIn('region_id', $regionIds); // Filter by region
            })
            ->count();